WildernessLabs/Meadow/configs/stm32f777zit6-meadow/src/hcom/hcom_exec_rqst_flash_fs.c
  ret = hcom_fs_helper_fs_initialize_proxy(partitionId);
  if (ret < 0)
  {
    f7syslog(LOG_ERR, "%s() ERROR: Initialize File System failed with error: %d\n", __func__, ret);
    strLen = snprintf(hostMsg, HCOM_TEMP_SHORT_HOST_STRING_LEN, "Initialize file system failed with error %d.\0", ret);
  }
  else
  {
    strLen = snprintf(hostMsg, HCOM_TEMP_SHORT_HOST_STRING_LEN, "Initialize file system completed. No errors reported\0");
  }

  // Send text message to host
  ret = hcom_host_msg_bldr_send_text(hostMsg, strLen);
  if (ret < 0)
  {
    f7syslog(LOG_ERR, "%s() ERROR: hcom_host_msg_bldr_send_text failed %d\n", __func__, ret);
  }
  f7syslog(LOG_NOTICE, "** Initialization of File System completed\n\n");
}

//=======================================================================================
void hcom_exec_flash_fs_format(uint32_t userData)
{
  char hostMsg[HCOM_TEMP_SHORT_HOST_STRING_LEN];
  int strLen;
  int ret;

  // Comes from hcom message
  // Valid partitions are 0 - n, where n is not greater than HCOM_FLASH_FILE_PARTITION_COUNT_MAX
  f7syslog(LOG_NOTICE, "** Format Flash File System beginning\n");

  ret = hcom_fs_helper_format_fs_proxy(userData);
  if (ret < 0)
  {
    f7syslog(LOG_ERR, "%s() ERROR: Format File System failed with error: %d\n", __func__, ret);
    strLen = snprintf(hostMsg, HCOM_TEMP_SHORT_HOST_STRING_LEN, "Format file system failed with error %d.\0", ret);
  }
  else
  {
    strLen = snprintf(hostMsg, HCOM_TEMP_SHORT_HOST_STRING_LEN, "Format file system completed. No errors reported\0");
  }

  // Send text message to host
  ret = hcom_host_msg_bldr_send_text(hostMsg, strLen);
  if (ret < 0)
  {
    f7syslog(LOG_ERR, "%s() ERROR: hcom_host_msg_bldr_send_text failed %d\n", __func__, ret);
  }
  f7syslog(LOG_NOTICE, "** Format File System completed\n\n");
}

//=======================================================================================
void hcom_exec_flash_fs_create(uint32_t userData)
{
  // This single call will partition, initialize, format (if needed) and mount the file system
  char hostMsg[HCOM_TEMP_SHORT_HOST_STRING_LEN];
  int strLen;
  int ret;

#ifdef CONFIG_SEMIHOSTING_STAT
  char *semihostingMsg = "File system creation is not possible with 'CONFIG_SEMIHOSTING_STAT' configured\0";
  hcom_host_msg_bldr_send_text(semihostingMsg, strlen(semihostingMsg));
  return;
#endif

  if(userData != HCOM_NUMBER_OF_FS_PARTITIONS)
  {
    strLen = snprintf(hostMsg, HCOM_TEMP_SHORT_HOST_STRING_LEN,
      "Currently, the number of partitions is hardcode at %d partitions. Please retry with this value.\0",
      HCOM_NUMBER_OF_FS_PARTITIONS);    
    ret = hcom_host_msg_bldr_send_text(hostMsg, strLen);
    if (ret < 0)
    {
      f7syslog(LOG_ERR, "%s() ERROR: hcom_host_msg_bldr_send_text failed %d\n", __func__, ret);
    }
    return;
  }

  f7syslog(LOG_NOTICE, "** Create entire Flash File System beginning\n");

  ret = hcom_fs_helper_create_partition_initialize_and_mount_fs(_master_mtd, userData);
  if (ret < 0)
  {
    f7syslog(LOG_ERR, "%s() ERROR: Create File System failed with error: %d\n", __func__, ret);
    strLen = snprintf(hostMsg, HCOM_TEMP_SHORT_HOST_STRING_LEN, "Create file system failed with error %d.\0", ret);
  }
  else
  {
    strLen = snprintf(hostMsg, HCOM_TEMP_SHORT_HOST_STRING_LEN, "Create file system completed. No errors reported\0");
  }

  // Send text message to host
  ret = hcom_host_msg_bldr_send_text(hostMsg, strLen);
  if (ret < 0)
  {
    f7syslog(LOG_ERR, "%s() ERROR: hcom_host_msg_bldr_send_text failed %d\n", __func__, ret);
  }
  f7syslog(LOG_NOTICE, "** Create File System completed\n\n");
}

//=======================================================================================
// userData contains the partition number
void hcom_exec_flash_fs_return_file_list(uint32_t userData)
{
  hcom_exec_flash_fs_get_file_list(userData, false);
}

//=======================================================================================
// userData contains the partition number
void hcom_exec_flash_fs_return_file_list_with_crc(uint32_t userData)
{
  hcom_exec_flash_fs_get_file_list(userData, true);
}

//=======================================================================================
// userData contains the partition number
void hcom_exec_flash_fs_get_file_list(uint32_t userData, bool getChecksum)
{
  char *csvList;
  char hostMsg[HCOM_TEMP_SHORT_HOST_STRING_LEN];
  int strLen;
  int ret;

  f7syslog(LOG_NOTICE, "** Getting file list for partition %d beginning. Will%sadd crc\n",
      userData, getChecksum ? " " : " NOT ");

  csvList = malloc(HCOM_MAX_RETURN_TEXT_TO_HOST);
  if(csvList == NULL)
  {
    f7syslog(LOG_ERR, "%s() ERROR: Memory allocation failed\n", __func__);
    strLen = snprintf(hostMsg, HCOM_TEMP_SHORT_HOST_STRING_LEN, "Memory allocation error. No results will be sent\0");
    ret = hcom_host_msg_bldr_send_text(hostMsg, strLen);
    f7syslog(LOG_NOTICE, "** Getting file list error exit\n");
    return;
  }

  // The list must begin with "FileList: " for the receiver to know it's not just text
  strcpy(csvList, "FileList: ");
  int preambleLen = strlen("FileList: ");

  if(getChecksum)
    ret = hcom_fs_helper_get_list_files_in_partition_and_crc(userData,
        csvList + preambleLen, HCOM_MAX_RETURN_TEXT_TO_HOST - preambleLen);
  else
    ret = hcom_fs_helper_get_list_files_in_partition(userData,
        csvList + preambleLen, HCOM_MAX_RETURN_TEXT_TO_HOST - preambleLen);
  
  if(ret == OK)
  {
    ret = hcom_host_msg_bldr_send_text(csvList, strlen(csvList));
  }
  else
  {
    strLen = snprintf(hostMsg, HCOM_TEMP_SHORT_HOST_STRING_LEN, "Internal error. No results will be sent\0");
    ret = hcom_host_msg_bldr_send_text(hostMsg, strLen);
  }

  free(csvList);

  if (ret < 0)
    f7syslog(LOG_ERR, "%s() ERROR: hcom_host_msg_bldr_send_text failed %d\n", __func__, ret);

  f7syslog(LOG_NOTICE, "** Getting file list exiting\n");
}

//=======================================================================================
void hcom_exec_flash_fs_delete(const uint8_t *recvPacketData, const size_t recvPacketDataSize,
    uint32_t partitionId)
{
  char hostMsg[HCOM_TEMP_SHORT_HOST_STRING_LEN];
  int strLen;
  int ret;

  size_t fileNameLength = recvPacketDataSize - HCOM_PROTOCOL_REQUEST_FILE_HDR_FILENAME_OFFSET;
  char *fileNameBuffer = malloc(fileNameLength + 1);
  fileNameBuffer[fileNameLength] = '\0';

  memcpy(fileNameBuffer, recvPacketData + HCOM_PROTOCOL_REQUEST_FILE_HDR_FILENAME_OFFSET, fileNameLength);

  ret = hcom_file_commands_delete_by_name(partitionId, HCOM_FILE_MOUNT_POINT_TARGET, fileNameBuffer);
  if (ret != OK)
  {
    f7syslog(LOG_ERR, "%s() Error returned from call to hcom_file_commands_delete_by_name: %d\n", __func__, ret);
    strLen = snprintf(hostMsg, HCOM_TEMP_SHORT_HOST_STRING_LEN, "Deletaion of file '%s' failed [Error %d]\0",
        fileNameBuffer, ret);
  }
  else
  {
    strLen = snprintf(hostMsg, HCOM_TEMP_SHORT_HOST_STRING_LEN, "File '%s' deleted. No errors reported\0",
        fileNameBuffer);
  }
  
