WildernessLabs/Meadow/configs/stm32f777zit6-meadow/src/hcom/hcom_exec_rqst_flash_fs.c
  free(fileNameBuffer);

  // Send text message to host
  ret = hcom_host_msg_bldr_send_text(hostMsg, strLen);
  if (ret < 0)
  {
    f7syslog(LOG_ERR, "%s() ERROR: hcom_host_msg_bldr_send_text failed %d\n", __func__, ret);
  }
}

//=======================================================================================
// Erase the entire qspi flash chip
// The only reason this is safe is because there is only one thread that receives, sends
// and processes all host communications.
void hcom_exec_flash_fs_flash_bulk_erase(uint32_t userData)
{
  char hostMsg[HCOM_TEMP_SHORT_HOST_STRING_LEN];
  int strLen;

  f7syslog(LOG_WARNING, "Bulk erase of QSPI Flash beginning\n");
  int ret = _master_mtd->ioctl(_master_mtd, MTDIOC_BULKERASE, 0);
  if (ret < 0)
  {
    f7syslog(LOG_ERR, "%s() ERROR: IOCTL MTDIOC_BULKERASE failed. Returned %d\n", __func__, ret);
  }

  strLen = snprintf(hostMsg, HCOM_TEMP_SHORT_HOST_STRING_LEN, "Bulk Erase of QSPI Flash completed.\0");
  ret = hcom_host_msg_bldr_send_text(hostMsg, strLen);
  if (ret < 0)
  {
    f7syslog(LOG_ERR, "%s() ERROR: hcom_host_msg_bldr_send_text failed. Returned %d\n", __func__, ret);
  }
  f7syslog(LOG_WARNING, "Bulk erase of QSPI Flash completed\n\n");
}

//=======================================================================================
// The only reason this is safe is because there is only one thread that receives, sends
// and processes all host communications.
void hcom_exec_flash_fs_flash_verify_erase(uint32_t userData)
{
  char hostMsg[HCOM_TEMP_SHORT_HOST_STRING_LEN];
  int strLen;
  FAR struct mtd_geometry_s geo;
  int sectorCounter;
  int errorSectors;
  int ret;

  f7syslog(LOG_NOTICE, "** Verification of QSPI Flash Erased state beginning\n");

  // Get geometry of QSPI Flash
  ret = _master_mtd->ioctl(_master_mtd, MTDIOC_GEOMETRY, (unsigned long)((uintptr_t)&geo));
  if (ret < 0)
  {
    f7syslog(LOG_ERR, "%s() ERROR: Read geometry for MTD failed: %d\n", __func__, ret);
    return;
  }

  f7syslog(LOG_INFO, "Verifying if entire MTD is erased, nerasesectors %d, sectorsize %d pagesize %d\n",
           geo.neraseblocks, geo.erasesize, geo.blocksize);

  uint8_t *readBuffer = (uint8_t *)malloc(geo.blocksize * HCOM_WRITEABLE_PAGES_PER_SECTOR);
  uint8_t *baseReference = (uint8_t *)malloc(geo.blocksize * HCOM_WRITEABLE_PAGES_PER_SECTOR);
  memset(baseReference, 0xff, geo.blocksize * HCOM_WRITEABLE_PAGES_PER_SECTOR); // base line for erased flash

  errorSectors = 0;

  for (sectorCounter = 0; sectorCounter < geo.neraseblocks; sectorCounter++)
  {
    size_t pagesRead = MTD_BREAD(_master_mtd, sectorCounter * HCOM_WRITEABLE_PAGES_PER_SECTOR,
                                  HCOM_WRITEABLE_PAGES_PER_SECTOR, readBuffer);
    if (pagesRead == HCOM_WRITEABLE_PAGES_PER_SECTOR)
    {
      ret = memcmp(baseReference, readBuffer, geo.blocksize * HCOM_WRITEABLE_PAGES_PER_SECTOR);
      if (ret != 0)
      {
        f7syslog(LOG_WARNING, "%s() WARNING: 4k byte sector at offset %04d is not erased\n", __func__, sectorCounter);
        errorSectors++;
      }
      continue;
    }

    if (pagesRead == 0)
      break; // End of data

    f7syslog(LOG_ERR, "%s() ERROR: Expected to read %d pages but read %d pages\n",
             __func__, HCOM_WRITEABLE_PAGES_PER_SECTOR, pagesRead);
    break;
  }

  f7syslog(LOG_INFO, "Verified %04d bytes (%d of %d sectors)\n",
           sectorCounter * geo.erasesize, sectorCounter, geo.neraseblocks);

  free(baseReference);
  free(readBuffer);

  f7syslog(LOG_NOTICE, "** Verified Erased Flash completed and found %d non-erased partitions.\n\n", errorSectors);

  // Send text message to host
  strLen = snprintf(hostMsg, HCOM_TEMP_SHORT_HOST_STRING_LEN, "Testing Erased Flash found %d non-erased partitions.\0",
   errorSectors);
  ret = hcom_host_msg_bldr_send_text(hostMsg, strLen);
  if (ret < 0)
  {
    f7syslog(LOG_ERR, "%s() ERROR: hcom_host_msg_bldr_send_text failed %d\n", __func__, ret);
  }
}

//=====================================================================
// Tried to align terminology with the s25fl256 docs. Page(256), Sector (4K)
// and Block (64k)
#define FLASH_TEST_DISPLAY_INTERVAL 1024

//=====================================================================
static int hcom_exec_flash_initialize_mtd_for_testing(void)
{
  if(_test_mtd != NULL)
    return OK;

  _test_mtd = _master_mtd;

  int ret = _test_mtd->ioctl(_test_mtd, MTDIOC_GEOMETRY, (unsigned long)((uintptr_t)&_test_geo));
  DEBUGASSERT(ret == OK);

  _flash_test_write_page_size = _test_geo.blocksize;
  _flash_test_total_mtd_bytes = _test_geo.neraseblocks * _test_geo.erasesize;
  _flash_test_total_write_pages = _flash_test_total_mtd_bytes / _test_geo.blocksize;
  _flash_test_pages_per_4k_sector = _test_geo.erasesize / _test_geo.blocksize;

  // syslog(0, "MTD Geo info - nerasesectors %u, erasesize %u pagesize %u, total pages %u, pages/sector %u\n",
  //          _test_geo.neraseblocks, _test_geo.erasesize, _test_geo.blocksize,
  //           _flash_test_total_write_pages, _flash_test_pages_per_4k_sector);
  return OK;
}

//=====================================================================
static void hcom_exec_flash_populate_buffer(uint32_t pageNumber, uint8_t *pageBuffer)
{
  off_t off;
  uint8_t 
  tempBuffer[3];

  // Pattern will be - Each 256 byte page will be divided into 64, 32-bit words. Each 32-bit
  // word will contain the page number 0 - 131072 (0x20000) (bits 0-17), the page offset
  // (bits 18-23) and the crc8 checksum of bytes 0-2 (bits 24-31)

  tempBuffer[0] = pageNumber & 0x000000ff;
  tempBuffer[1] = (pageNumber & 0x0000ff00) >> 8;
  tempBuffer[2] = (pageNumber & 0x00030000) >> 16;

  // syslog(0, "pageNumber = %d buff[0] 0x%02x, buff[1] 0x%02x, buff[2] 0x%02x\n",
  //     pageNumber, tempBuffer[0], tempBuffer[1], tempBuffer[2]);

  for(off = 0; off < _flash_test_write_page_size; off += 4)
  {
    pageBuffer[off]     = tempBuffer[0];
    pageBuffer[off + 1] = tempBuffer[1];
    pageBuffer[off + 2] = tempBuffer[2];
    pageBuffer[off + 2] |= off;  // use offset / 4 (0 - 64)
    pageBuffer[off + 3] = crc8(pageBuffer + off, 3);

    // syslog(0, "  offset = %04d (0x%02x) buff[2] 0x%02x, buff[3] 0x%02x\n", off, ((off >> 2) & 0x3f) << 2,
    //   pageBuffer[off+2], pageBuffer[off+3]);
  }
}

//=====================================================================
// Takes a populated page buffer and verifies that its contents match
// what should be in it.
static bool hcom_exec_flash_verify_buffered_data(uint32_t pageNumber, uint8_t *pageBuffer)
{
  uint8_t testBuffer[_flash_test_write_page_size];

  hcom_exec_flash_populate_buffer(pageNumber, testBuffer);

  // syslog(0, "\n--------- data read ----------\n");
  // hcom_diag_print_buffer(pageBuffer, _flash_test_write_page_size, 0);
  // syslog(0, "\n--------- data calculated ----------\n");
  // hcom_diag_print_buffer(testBuffer, _flash_test_write_page_size, 0);

  if(memcmp(pageBuffer, testBuffer, _flash_test_write_page_size) == 0)
    return true;

