WildernessLabs/Meadow/configs/stm32f777zit6-meadow/src/hcom/hcom_exec_rqst_flash_fs.c
  return false;
}

//===========================================================
static void hcom_exec_flash_fs_flash_test_erase_used_4k_sectors(void)
{
  hcom_exec_flash_test_find_display_used_pages(true, false);
}

//===========================================================
static void hcom_exec_flash_test_find_display_erased_pages(void)
{
  hcom_exec_flash_test_find_display_used_pages(false, true);
}

//===========================================================
// This function can display or erase the used sectors
static void hcom_exec_flash_test_find_display_used_pages(bool eraseUsedPages, bool displayErasedPages)
{
  off_t pageOff;
  int nread;
  int numbUsed = 0;
  bool patternFailed;
  bool eraseFailed;

  uint8_t pageBuffer[_flash_test_write_page_size];
  uint8_t eraseBuffer[_flash_test_write_page_size];
  memset(eraseBuffer, 0xff, _flash_test_write_page_size);

  if(eraseUsedPages && displayErasedPages)
  {
    syslog(0, "Unsupported request\n");
    return;
  }
  else if(eraseUsedPages)
    syslog(0, "Checking %d pages to erase those used\n", _flash_test_total_write_pages);
  else if(displayErasedPages)
    syslog(0, "Checking %d pages to display those erased\n", _flash_test_total_write_pages);
  else
    syslog(0, "Checking %d pages to display those used\n", _flash_test_total_write_pages);

  // Now read and test that the entire qspi flash is correct
  for(pageOff = 0; pageOff < _flash_test_total_write_pages; pageOff++)
  {
    patternFailed = false;
    eraseFailed = false;

    nread = MTD_BREAD(_test_mtd, pageOff, 1, pageBuffer);
    DEBUGASSERT(nread == 1);

    // We are only interested in pages that do not have the
    // normal test pattern and are not erased.
    if(!hcom_exec_flash_verify_buffered_data(pageOff, pageBuffer))
      patternFailed = true;

    if(memcmp(eraseBuffer, pageBuffer, _flash_test_write_page_size) != 0)
      eraseFailed = true;

    // Erase sectir if it's not erased
    if(eraseUsedPages && (eraseFailed || patternFailed))
    {
      // Note this erases multiple pages
      uint32_t sectorOff = pageOff / _flash_test_pages_per_4k_sector;
      syslog(0, "Page offset %u (0x%08x) used. Erasing associated 4k sector %u (0x%08x)\n",
          pageOff, pageOff, sectorOff, sectorOff);
      hcom_exec_flash_fs_flash_test_erase_1_4k_sector(sectorOff);
      numbUsed++;
    }
    else if(displayErasedPages && patternFailed && !eraseFailed)
    {
      // Assumes pattern written to entire flash device except where erased.
      // Used to verify erase functionality.
      // Display erased page
      uint32_t sectorOff = pageOff / _flash_test_pages_per_4k_sector;
      syslog(0, "Page offset %u (0x%08x) erased. Associated 4k erase sector %u (0x%08x)\n",
          pageOff, pageOff, sectorOff, sectorOff);
      numbUsed++;
    }
    else if(patternFailed && eraseFailed)
    {
      // Just display if not pattern nor erased
      syslog(0, "\n--------- data read from page# %d----------\n", pageOff);
      hcom_diag_print_buffer(pageBuffer, _flash_test_write_page_size, 0);
      numbUsed++;
    }
  }

  if(eraseUsedPages)
    syslog(0, "Erased %d used pages\n", numbUsed);
  else if(displayErasedPages)
    syslog(0, "Found %d erased pages\n", numbUsed);
  else
    syslog(0, "Found %d used pages\n", numbUsed);
}

//=====================================================================
static bool hcom_exec_flash_test_qspi_data_rw(bool verifyPages)
{
  uint8_t pageBuffer[_flash_test_write_page_size];
  off_t pageOff;
  int nread;
  int nfailed = 0;
  
  syslog(0, "QSPI Flash data testing %d pages has begun.\n", _flash_test_total_write_pages);

#if 1 // Disable to allow retesting after power cycle etc.
  int nwrite;
  syslog(0, "MTD initialized to %p. Bulk erasing QSPI flash next.\n", _test_mtd);
  int ret = _test_mtd->ioctl(_test_mtd, MTDIOC_BULKERASE, 0);
  DEBUGASSERT(ret == OK);
  syslog(0, "Bulk erase completed. Writing data to %d pages\n", _flash_test_total_write_pages);

  // Fill the entire QSPI flash with data
  for(pageOff = 0; pageOff < _flash_test_total_write_pages; pageOff++)
  {
    hcom_exec_flash_populate_buffer(pageOff, pageBuffer);

    if(pageOff % FLASH_TEST_DISPLAY_INTERVAL == 0)
      syslog(0, "Writing to page %d of %d\n", pageOff, _flash_test_total_write_pages);

    nwrite = MTD_BWRITE(_test_mtd, pageOff, 1, pageBuffer);
    DEBUGASSERT(nwrite == 1);
  }
#endif

  if(!verifyPages)
  {
    syslog(0, "Pattern written to %d pages\n", _flash_test_total_write_pages);
    return true;
  }
  
  syslog(0, "Data written. Verifying %d pages\n", _flash_test_total_write_pages);
  
  // Now read and test that the entire qspi files is correct
  for(pageOff = 0; pageOff < _flash_test_total_write_pages; pageOff++)
  {
    if(pageOff % FLASH_TEST_DISPLAY_INTERVAL == 0)
      syslog(0, "Verifying page %d of %d\n", pageOff, _flash_test_total_write_pages);

    nread = MTD_BREAD(_test_mtd, pageOff, 1, pageBuffer);
    DEBUGASSERT(nread == 1);

    if(!hcom_exec_flash_verify_buffered_data(pageOff, pageBuffer))
    {
      if(nfailed == 0)
      {
        syslog(0, "Page %d first to fail to compare\n", pageOff);
      }
      else
      {
        if(pageOff % FLASH_TEST_DISPLAY_INTERVAL == 0)
          syslog(0, "Page %d also failed to compare\n", pageOff);
      }
      nfailed++;
    }
  }
  syslog(0, "Write / read test completed with %d errors\n", nfailed);

  return nfailed ? true : false;
}

//=====================================================================
static void hcom_exec_flash_qspi_comprehensive_test(void)
{
  int ret;
  off_t pageOff;
  int nwrite, nread;
  off_t beforeOff, afterOff;

  uint8_t pageBuffer[_flash_test_write_page_size];
  uint8_t eraseBuffer[_flash_test_write_page_size];
  memset(eraseBuffer, 0xff, _flash_test_write_page_size);

  syslog(0, "Comprehensive testing %d pages has begun.\n", _flash_test_total_write_pages);
  syslog(0, "Bulk erasing QSPI flash\n");
  ret = _master_mtd->ioctl(_test_mtd, MTDIOC_BULKERASE, 0);
  DEBUGASSERT(ret == OK);

