WildernessLabs/Meadow/configs/stm32f777zit6-meadow/src/hcom/hcom_exec_rqst_flash_fs.c
  for(pageOff = 0; pageOff < _flash_test_total_write_pages; pageOff++)
  {
    if(pageOff % FLASH_TEST_DISPLAY_INTERVAL == 0)
      syslog(0, "Testing page %d of %d\n", pageOff, _flash_test_total_write_pages);

    // Write next page
    hcom_exec_flash_populate_buffer(pageOff, pageBuffer);
    nwrite = MTD_BWRITE(_test_mtd, pageOff, 1, pageBuffer);
    DEBUGASSERT(nwrite == 1);

    // And verify that this page has been written correctly
    nread = MTD_BREAD(_test_mtd, pageOff, 1, pageBuffer);
    DEBUGASSERT(nread == 1);
    if(!hcom_exec_flash_verify_buffered_data(pageOff, pageBuffer))
    {
      syslog(0, "Just written page %d failed to compare\n", pageOff);
    }

    // Next verify that all proceeding and subsequent pages are
    // correct. Those before should have data and those following
    // should be erased (0xff).
    for(beforeOff = 0; beforeOff < pageOff; beforeOff++)
    {
      if(beforeOff % FLASH_TEST_DISPLAY_INTERVAL == 0)
          syslog(0, "Testing before page %d of %d\n", beforeOff, _flash_test_total_write_pages);

      nread = MTD_BREAD(_test_mtd, beforeOff, 1, pageBuffer);
      DEBUGASSERT(nread == 1);
      if(!hcom_exec_flash_verify_buffered_data(pageOff, pageBuffer))
      {
        syslog(0, "Proceeding page %d failed to compare\n", beforeOff);
      }
    }

    for(afterOff = pageOff + 1; afterOff < _flash_test_total_write_pages; afterOff++)
    {
      if(afterOff % FLASH_TEST_DISPLAY_INTERVAL == 0)
          syslog(0, "Testing after page %d of %d\n", afterOff, _flash_test_total_write_pages);

      nread = MTD_BREAD(_test_mtd, afterOff, 1, pageBuffer);
      DEBUGASSERT(nread == 1);
      if(memcmp(eraseBuffer, pageBuffer, _flash_test_write_page_size) != 0)
      {
        syslog(0, "Following page %d failed to compare\n", afterOff);
      }
    }
  }
  return;
}

//=======================================================================================
static void hcom_exec_flash_test_read_display_1_page(uint32_t pageOffset)
{
  uint8_t pageBuffer[_flash_test_write_page_size];

  syslog(0, "Reading 256 bytes from QSPI flash at page# %d\n", pageOffset);
  int nread = MTD_BREAD(_test_mtd, pageOffset, 1, pageBuffer);
  DEBUGASSERT(nread == 1);

  syslog(0, "\n--------- data read from page# %d----------\n", pageOffset);
  hcom_diag_print_buffer(pageBuffer, _flash_test_write_page_size, 0);
}

//=======================================================================================
// Erase secctors are 4096 bytes each
static void hcom_exec_flash_fs_flash_test_erase_1_4k_sector(uint32_t sectorOffset)
{
  int ret;

  syslog(0, "Erasing QSPI flash erase sector# %d\n", sectorOffset);
  ret = MTD_ERASE(_test_mtd, sectorOffset, 1);
  DEBUGASSERT(ret >= 0);
  syslog(0, "Sector erase of QSPI flash completed\n");
}

//=======================================================================================
static void hcom_exec_flash_fs_flash_test_erase_entire_flash(void)
{
  int ret;

  syslog(0, "Bulk erasing QSPI flash\n");
  ret = _test_mtd->ioctl(_test_mtd, MTDIOC_BULKERASE, 0);
  DEBUGASSERT(ret == OK);
  syslog(0, "Bulk erase of QSPI flash completed\n");
}

//=======================================================================================
// This function is only used to test the qspi flash as it is not working properly
void hcom_exec_flash_fs_flash_test_write_s25fl(uint32_t userData)
{
  uint8_t pageBuffer[_flash_test_write_page_size];
  int ret;

  if(_test_mtd == NULL)
  {
    ret = hcom_exec_flash_initialize_mtd_for_testing();
    DEBUGASSERT(ret == OK);
  }

  switch((int32_t)userData)
  {
    case -1:
      hcom_exec_flash_test_qspi_data_rw(true);
      break;

    case -2:
      hcom_exec_flash_test_qspi_data_rw(false);
      break;

    case -3:
      hcom_exec_flash_qspi_comprehensive_test();
      break;

    default:
      // Populate the buffer with one page number and write it to MTD
      hcom_exec_flash_populate_buffer(userData, pageBuffer);
      ret = MTD_BWRITE(_test_mtd, userData, 1, pageBuffer);
      DEBUGASSERT(ret == 1);
      break;
  }
  syslog(0, "Testing command for flash completed\a\n");

  return;
}
//=======================================================================================
// This function is only used to test the qspi flash as it is not working properly
void hcom_exec_flash_fs_flash_test_init_s25fl(uint32_t userData)
{
  int ret;

  if(_test_mtd == NULL)
  {
    ret = hcom_exec_flash_initialize_mtd_for_testing();
    DEBUGASSERT(ret == OK);
  }
  
  switch((int32_t)userData)
  {
    case -1:
      hcom_exec_flash_fs_flash_test_erase_entire_flash();    
      break;

     case -2:
      hcom_exec_flash_fs_flash_test_erase_used_4k_sectors();    
      break;

   default:
      hcom_exec_flash_fs_flash_test_erase_1_4k_sector(userData);
      break;
  }
  
  syslog(0, "Erase command for flash completed\a\n");
}

//=======================================================================================
// This function is only used to test the qspi flash as it is not working properly
void hcom_exec_flash_fs_flash_test_read_s25fl(uint32_t userData)
{
  int ret;

  if(_test_mtd == NULL)
  {
    ret = hcom_exec_flash_initialize_mtd_for_testing();
    DEBUGASSERT(ret == OK);
  }

  switch((int32_t)userData)
  {
    case -1:
      hcom_exec_flash_test_find_display_used_pages(false, false);
      break;

    case -2:
      hcom_exec_flash_test_find_display_erased_pages();
      break;

    default:
      hcom_exec_flash_test_read_display_1_page(userData);
      break;
  }

  syslog(0, "Read command for flash completed\a\n");
  sleep(5);
}

